In [2]:
import pandas as pd

data = pd.read_csv("nba.csv" , index_col='Name')

data.head(5)

first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]


print(first , "\n\n\n" , second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

Using loc() method

In [4]:
# Selecting multiple rows
first = data.loc[['Avery Bradley' ,'R.J. Hunter']]
display(first)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [5]:
# Select multiple rows and multiple columns 
first = data.loc[['Avery Bradley' ,'R.J. Hunter'] , ['Team' , 'Number' , 'Age' , 'Salary']]
display(first)

                         Team  Number   Age     Salary
Name
Avery Bradley  Boston Celtics     0.0  25.0  7730337.0
R.J. Hunter    Boston Celtics    28.0  22.0  1148640.0

In [6]:
# Selecting all rows and specific columns 
first = data.loc[: , ['Team' , 'Number' , 'Age' , 'Salary']]
display(first)

                         Team  Number   Age     Salary
Name
Avery Bradley  Boston Celtics     0.0  25.0  7730337.0
Jae Crowder    Boston Celtics    99.0  25.0  6796117.0
John Holland   Boston Celtics    30.0  27.0        NaN
R.J. Hunter    Boston Celtics    28.0  22.0  1148640.0
Jonas Jerebko  Boston Celtics     8.0  29.0  5000000.0
...                       ...     ...   ...        ...
Shelvin Mack        Utah Jazz     8.0  26.0  2433333.0
Raul Neto           Utah Jazz    25.0  24.0   900000.0
Tibor Pleiss        Utah Jazz    21.0  26.0  2900000.0
Jeff Withey         Utah Jazz    24.0  26.0   947276.0
NaN                       NaN     NaN   NaN        NaN

[458 rows x 4 columns]

using iloc() method

In [7]:
# Selecting a single row 
row2 = data.iloc[3]
display(row2)

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [8]:
# Selecting multiple rows 
row2 = data.iloc[[2 , 4 , 6]]
display(row2)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0

In [12]:
# Selecting specific rows and specific columns 
row2 =  data.iloc[[2 , 5 , 6] , : 10] 
display(row2)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0